<?php

namespace Database\Seeders;

use App\Models\User;
use App\Models\Profile;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class ProfileSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        $admin = Profile::create([
            'user_id' => 1,
            // 'user_id' => User::all()->random()->id,
            'name' => 'متاح',
            'gender' => 'female',
            'mobile' => '773065471',
            'country' => 'Yemen',

            'account_type' => 'provider',
            'job_title' => 'backend developer',
            'specialization' => 'platform',
            'bio' => '"',
        ]);
        $Dhoha = Profile::create([
            'user_id' => 2,
            // 'user_id' => User::all()->random()->id,
            'name' => 'ضحى الخراساني',
            'gender' => 'female',
            'mobile' => '773065471',
            'country' => 'Yemen',

            'account_type' => 'provider',
            'job_title' => 'backend developer',
            'specialization' => 'backend developer',
            'bio' => '"إنه قارئ ومفسر ومبدع في آنٍ واحد.. ذلك هو المترجم." بيجاي كومار داس.

            مترجمة محترفة على مستوى عالي من الدقة والمهارة. خريجة بكالوريوس لغة انجليزية وترجمة وحاصلة على شهادة التوفل وتدريبات مكثفة في اللغة الانجليزية والترجمة. امتلك من الخبرة مايزيد عن 12 عام في هذا المجال.
            
            لا اتقدم لاي مشروع الا اذا كنت واثقة انني استطيع انجازه باحترافية بنسبة 100%. انا مواظبة جدا واهتم بالتفاصيل الصغيرة لاي عمل انجزه.
            
            الخدمات التي اقدمها:
            
            *الترجمة من اللغة العربية <> اللغة الانجليزية.
            
            *التدقيق اللغوي.
            
            *اعمال التلخيص واعادة الصياغة من والى اللغتين.
            
            *التفريغ الصوتي.
            
            *الترجمة المرئية Subtitles.
            انه لمن دواعي سروري ان انجز مشاريعك باقل وقت ممكن وعلى درجة عالية من الدقة والمهنية.
            
            رضا الزبائن هو هدفي الاول واضمن لك تسليمك العمل في اقرب وقت وبافضل نتيجة.
            تواصل معي عبر الرسائل لمناقشة تفاصيل مشروعك.',
        ]);
        $Fatima = Profile::create([
            'user_id' => 3,
            // 'user_id' => User::all()->random()->id,
            'name' => 'فاطمة المشهور',
            'gender' => 'female',
            'mobile' => '771951728',
            'country' => 'Yemen',

            'account_type' => 'provider',
            'job_title' => 'fullstack developer',
            'specialization' => 'fullstack developer',
            'bio' => '"هداء" مصممة جرافيك .

            أمتلك خبرة العديد من السنوات في العمل على برامج التصميم المتنوعة بإتقان وإحترافية.
            
            أسعى دائماً لإخراج تصاميم مميزة، وابداعية تتناسب مع متطلبات العميل لمساعدته في تحقيق أهدافه المرجوة من التصميم .
            
            توظيفي للعمل على مشروعك سيوفر لك خدمات مميزة وإبداعية تناسب ذوقك :
            
            - تصميم المطبوعات.
            
            - تصميم الشعارات والهوية البصرية .
            
            - تصميم ورسم الشخصيات ثنائية الأبعاد
            
            - المونتاج
            
            - الموشن جرافيك
            
            - تصميم مقاطع الرسوم المتحركة
            
            - التعليق الصوتي
            
            عند عملك معي ستجدني شغوفة, ملهمة , صبورة, ومبدعة .. وسأحرص على أن أرتقي بتصميمك ليحقق اهداف ومتطلبات مشروعك .
            
            يسعدني زيارتكم معرض أعمالي ،،
            
            اشكركم لاهتمامكم وطابت أوقاتكم بالخير ،،',
        ]);
        $Afnan = Profile::create([
            'user_id' => 4,
            // 'user_id' => User::all()->random()->id,
            'name' => 'أفنان القدسي',
            'gender' => 'female',
            'mobile' => '774971302',
            'country' => 'Yemen',

            'account_type' => 'provider',
            'job_title' => 'frontend developer',
            'specialization' => 'frontend developer',
            'bio' => 'خليل النوونو

            مصمم جرافيك من سنة 2009
            
            حاصل على شهادة Adobe
            
            خبير في تصميم packaging ( تغليف المنتجات )
            
            خبير في تصميم branding ( الهويات البصرية والشعارات )
            
            خبير في تصميم المطبوعات و الاعلانات ( بوسترات - بيلبرود - رول اب الخ)
            
            خبير في تصميم اعلانات السوشيال ميديا
            قمت بتفعيل حسابي في موقع مستقل في شهر 10 / 2021',
        ]);
        $Roqaiah = Profile::create([
            'user_id' => 5,
            // 'user_id' => User::all()->random()->id,
            'name' => 'رقية سيف',
            'gender' => 'female',
            'mobile' => '770695605',
            'country' => 'Yemen',
            'account_type' => 'provider',
            'job_title' => 'frontend developer',
            'specialization' => 'frontend developer',
            'bio' => 'مصمم جرافيك

            مخرج صحفي
            
            متخصص في تنسيق الكتب والرسائل الجامعية
            
            أعمل في المجال منذ 18 سنة تقريبا
            
            خبرة في برامج الإنديزاين والفوتوشوب والإليستريتور والكورل درو والورد
            
            خبرة في تصميم البوسترات الاعلانية ، المطبوعات ، الشعارات، وتصميم الهوية التجاريه الكامله وتصاميم السوشيال ميديا وتصميم الكتب التعليمية للاطفال والقصص والانفوجرافيك ، الملصقات الاعلانية ،
            
            - يمكنني فعل أي شيء في Photoshop و Illustrator و In Design
            
            - جودة العمل هي أهم شيء بالنسبة لي ويمكنني دائمًا تقديمها سواء كان المشروع كبيرًا أو صغيرًا.',
        ]);
        $Mohammed = Profile::create([
            'user_id' => 6,
            // 'user_id' => User::all()->random()->id,
            'name' => 'محمد الدعيس',
            'gender' => 'male',
            'mobile' => '770527144',
            'country' => 'Yemen',
            'account_type' => 'provider',
            'job_title' => 'photoshop designer',
            'specialization' => 'photoshop designer',
            'bio' => 'انا مطور ويب full stack اعمل بلغات html5 ,css3. javascript, jquery, ajax, laravel framework, json, bootstrap

            حاصل على بكالريوس نظم معلومات ادارية بتقدير امتياز
            
            حاصل على شهادة معتمدة من مركز يات التعليمى بالمعادى فى مصر',
        ]);
        $Haifa = Profile::create([
            'user_id' => 7,
            // 'user_id' => User::all()->random()->id,
            'name' => 'هيفاء نبيل',
            'gender' => 'female',
            'mobile' => '777526457',
            'country' => 'Yemen',

            'account_type' => 'provider',
            'job_title' => 'illustratior designer',
            'specialization' => 'illustratior designe',
            'bio' => 'مهندس مدني حاصل على شهادة بكالوريوس الهندسة المدنية بتقدير جيد جدا.

            عملت في مكتب استشاري لإعداد وتصميم المخططات الهندسية ، وأعمل في مجال المقاولات كمهندس موقع ... وبهذا جمعت بين الجانب النظري والعملي للإتقان والوصول لأفضل جودة بأقل تكلفة.
            
            أقدم خدماتي في مجالات متنوعة من خلال:
            
            -تصميم المخططات المعمارية والإنشائية والكهربائية والميكانيكية للمنشآت .
            
            -تجهيز المخططات التنفيذية للمنشآت
            
            -حساب الكميات بدقة عالية في الأعمال الخرسانية وفي أعمال التشطيبات .
            
            -تحليل الأسعار وحساب التكلفة التقديرية للأعمال.
            
            -مراجعة المخططات الإنشائية.
            
            -إعداد الجداول الزمنية للمشروع الإنشائي
            
            -إعداد كافة مستخلصات الاعمال (الحصر والمالية).
            
            -مهندس تصميم وإخراج المخططات بكل حرافية باستخدام كل من برامج التصميم.
            
            -استخدام البرامج الهندسية اللازمة مثل Auto Cad civil ،Robot Structural ، Prokon ،CSI Safe & Etabs ،Microsoft Office programs : (Word, PowerPoint, Excel and Access).
            
            -استخدام الاكسل والوورد باحترافية عالية .
            
            -تصميم عروض البوربوينت.
            
            أشكرك على وقتك الثمين، وكن مطمئنًا لأن عملك معي سيفوق توقعاتك.',
        ]);
        $Mokhtar = Profile::create([
            'user_id' => 8,
            // 'user_id' => User::all()->random()->id,
            'name' => 'مختار غالب',
            'country' => 'Yemen',

            'account_type' => 'provider',
            'job_title' => 'Flutter programm',
            'specialization' => 'Flutter programming',
            'bio' => 'مرحبا بكم وأسعد بزيارتكم ملفي الشخصي.

            شريف سمير مصمم جرافيك ومحترف في رسم الكاريكاتير والشخصيات الكرتونية
            
            متخصص في تصميم الشعارات - وكافة انواع الدعاية المطبوعة والبصرية -
            
            بناء علامات تجارية ( Logo design )
            
            تصميم هويات بصرية تجارية بجميع محتوياتها ( كروت شخصية - خطابات
            
            مراسلة -أظرف - ختم - فواتير الخ )
            
            تصميم المطبوعات بكافة أنواعها (فلاير - بروشور - بانرات - رول أب - بوب أب - أسطوانات - فولدرات)
            
            التزم الدقة في التنفيذ والأحترافية في الأداء والالتزام بموعد التسليم
            
            أهم شيء بالنسبة لي هو ارضاء العميل عن العمل
            
            يسعدني رأيتك لمعرض اعمالي
            
            تحياتي....',
        ]);
        $Haitham = Profile::create([
            'user_id' => 9,
            // 'user_id' => User::all()->random()->id,
            'name' => 'هيثم أمين',
            'country' => 'Yemen',

            'account_type' => 'provider',
            'job_title' => 'C++ programm',
            'specialization' => 'C++ programming',
            'bio' => 'مرحبا بك، شكرا لك على زيارة ملفي الشخصي.

            أنا بلال مصمم جرافيك محترف،
            
            - لدي أزيد من اربع سنوات من الخبرة في مجال التصميم الإعلاني
            
            - حاصل على لقب بائع موثوق في خمسات
            
            - أصمم البوستات لمواقع التواصل الاجتماعي - ( فيسبوك - تويتر - انستقرام - سناب شات - لينكدن - يوتيوب .. الخ ) وكذلك الصور المصغرة - التي توضع في فيديوهات يوتيوب ( YouTube thumbnail ) .
            
            - أصمم صور للمقالات والتدوينات بجودة عالية وبتصميمات مميزة ومعبرة عن المحتوى.
            
            - أصمم ستيكرات ( اغلفة ) المنتجات بمختلف انواعها.
            
            - أصمم الاعلانات بمختلف أنواعها سواء كانت للنشر في الانترنت او للطباعة ( بروشورات، مطويات، بوسترات، فلاير ..الخ ).
            
            - أصمم السير الذاتية (CV or Resume ) ، بطائق الأعمال ( Card business ).
            
            - أصمم أغلفة ( Cover ) لمواقع التواصل الاجتماعي، وكذلك أغلفة للكتب او الكتيبات وتكون جاهزة للطباعة.
            تواصل(ي) معي إذا كان لديك أي استفسار حول عملي وسأكون سعيد بالرد عليك في أقرب وقت ممكن.',
        ]);
    }
}