<?php
return [
    "Links" => "روابط",
    "ContactUs"=>" تواصل معنا  ",
    "aboutus" => "بشأننا",
    "Services" => "خدماتنا",
    "text"=>" منصه ابداعيه تجمع بين اصحاب الاعمال والمطور الحر لتسهيل العمل وضمان الحقوق بجوده عاليه وسهوله ",
    "help"=>"مركز المساعدة",
    "works"=>"معرض الأعمال",



    //////////////////about us//////////////////

    "about_title" =>" وكلني هو أكبر منصة للعمل الحر في العالم العربي",
    "about_text" =>"يعمل مستقل على وصل الشركات وأصحاب المشاريع بأفضل المستقلين المحترفين لمساعدتهم على تنفيذ أفكارهم ومشاريعهم، وفي الوقت نفسه يتيح للمستقلين مكانا لإيجاد مشاريع يعملون عليها وزيادة مصادر دخلهم.",
    "read_more" => "إقرا اكثر",
    "team" => "فريقنا",

];
   