<?php
return [
    'feature1' => 'نفّذ مشاريعك بسهولة',
    'feature2' => 'وظّف أفضل المستقلين',
    'feature3' => 'ادفع بكل أريحية',
    'feature4' => 'ابنِ فريق عمل متكامل',
    'feature5' => 'انجز أعمالك بسرعه',
    'feature6' => 'نفذ مشاريعك بتكاليف أقل',
    'feature_des_1' => 'اطرح مشروعك واترك مهمة تنفيذه لأفضل خبراء الوطن العربي',
    'feature_des_2' => 'زُر ملفات المستقلين، اطلع على أعمالهم السابقة وظف الأفضل',
    'feature_des_3' => 'لن تدفع سوى مقابل ما يتم إنجازه من وظائف',
    'feature_des_4' => 'خبراء في مختلف المجالات ومن مختلف البلدان',
    'feature_des_5' => 'اختر أفضل المستقلين وأرسل له الوظيفة مباشرة مع ضمان كامل حقوقك',
    'feature_des_6' => 'وظّف أفضل الخبرات حسبما يتناسب مع ميزانيتك',
    'cate1' => 'أعمال وخدمات استشارية وإدارية',
    'cate2' => 'برمجة، تطوير وبناء المواقع والتطبيقات',
    'cate3' => 'تصميم، فيديو وصوتيات',
    'cate4' => 'تسويق إلكتروني ومبيعات',
    'cate5' => 'كتابة، تحرير، ترجمة ولغات',
    'cate6' => 'تدريب، تعليم ومساعدة عن بعد',
    'q1' =>  'ماهو متاح ',
    'q2' =>  'كيف استفيد منه؟',
    'q3' =>  'ماهي الخدمات؟',
    'distinguishes' =>  'مايميزنا ؟',
    'dont_chance' =>  'لا تضيع الفرصه',
    'category_kalefny' =>  'أقسام متاح',
    'Question_major' =>  'الاسأله الشائعه',
    'kalefny' =>  'منصه ابداعيه تجمع بين اصحاب الاعمال والمطور الحر لتسهيل العمل وضمان الحقوق بجوده عاليه وسهوله ',
    'benefints' =>  'في منصة متاح تستطيع إضافة مشروعك كإنشاء موقع ويب أو تطبيق جوال أو حتى تصميم شعار وتلقي عروض من المستقلين المحترفين المهتمين بالعمل عليه لتقارن بين العروض وتختار أفضلها، ثم تقوم بتوظيف المستقل صاحب أفضل عرض وتتولى المتابعة معه حتى إتمام تنفيذ مشروعك، كما يمكنك البحث بنفسك عن أفضل المستقلين وتعرض عليهم مشروعك بشكل مباشر للعمل عليه. ',
    'service' =>  'تصاميم بدقة عالية وسرعة في الاداء , تصاميم باسعار منافسة ودقة في الاداء, تصاميم مواقع الكترونية واعلانات وفوتشوب...الخ'  ,
    '' =>  ' '


];
