<?php

return [
    'Personal_Info' => ' تعديل ملفي الشخصي',
    'skills' => 'مهاراتي',
    'notifacation' => 'تنبيهاتي',
'wallet' => 'محفظتي',
    ////////////////////////////person informaion //////////
    'type' => 'نوع الحساب',
    'person1' => ' صاحب مشاريع ',
    'person2' => ' متاح ',
    'person21' => ' متاح للتوظيف ',
    'person3' => '  التخصص    ',

    'person4' => '  المسمى الوظيفي    ',
    'person5' => '  النبذة التعريفية',
    'person6' => ' الفيديو التعريفي',

    ////////////////////////////skills//////////
    'skill1' => ' أعمال وخدمات استشارية',
    'skill2' => '  برمجة، تطوير المواقع والتطبيقات',
    'skill3' => '  هندسة، عمارة وتصميم داخلي    ',
    'skill4' => '  تصميم، فيديو وصوتيات    ',
    'skill5' => '  تسويق الكتروني ومبيعات',
    'skill6' => '  كتابة، تحرير، ترجمة ولغات',
    'skill7' => '  دعم، مساعدة وإدخال بيانات',

    ////////////////////notifacations/////////////
    'notifacations1' => ' الإشعارات البريدية',
    'note1' => ' الموافقة على مشروع قيد المراجعة',
    'note2' => ' إكمال مشروع قيد التنفيذ',
    'note3' => ' دعوة لإضافه عرض',
    'note4' => ' عرض توظيف في مشروع خاص',
    'note5' => '   قبول عرضك',
    'note6' => ' ردود جديدة في نقاش المشاريع',
    'note7' => '  حدوث معاملة مالية',
    'note8' => ' ملخص للرسائل غير المقروءة',
    'note9' => '  إضافه عرض جديد لمشروعك',
    'note10' => '  ملخص المشاريع الجديدة',
    'notifacations2' => 'الإشعارات الداخلية',
    'note11' => ' إضافة عرض جديد على مشروعك',
    'note12' => '  تعديل عرض تم إضافته على مشروعك',


];
